# 1

# for 문 반복 숙달

# 250 부터 0까지 50 간격으로 출력하시오.
for i in range(250,-50,-50):
    print(i,end=' ') ## 출력 줄바꿈 없애기

# 결과 : 250 200 150 100 50 0

# 100 부터 400 까지 100 간격으로 출력하시오.
for i in range(100,500,100):
    print(i,end=' ')
#결과 : 100 200 300 400

# 200 부터 -200 까지 20 간격으로 출력하시오.
for i in range(200,-220,-20):
    print(i,end=' ')
# 결과 : 200 180 160 140 120 100 80 60 40 20 0 -20 -40 -60 -80 -100 -120 -140 -160 -180 -200




# 2
# 응용

# 리스트 & for문 활용하기

sample2 = [10,20,30,40,50,60,70,80]
# 위 샘플 리스트를 꺼내서 출력해보세요.
for i in sample2:
    print(i , end=' ')
# 결과 10 20 30 40 50 60 70 80


sample = [1,3,5,7,9]

# 위 샘플 리스트의 각 요소에 *3 을 한 값을 출력하세요.
for i in sample: # 여기 뭐넣어야 할까요
    print( i*3 ,end=' ')

# 결과 : [3,9,15,21,27]



# 챌린지 !!!
# 아래 변수명에 들어갈 변수를 잘 찾아 넣어봅시다.
# 그리고 어떻게 동작할 지 생각해봅시다.
sample3 = [[0,20],[1,30],[2,40],[3,50]]
for idx, value in sample3:
    print(f'인덱스{idx} : {value}', end=' ')

# 결과 : 인덱스0 : 20 인덱스1 : 30 인덱스2 : 40 인덱스3 : 50


## 챌린지 2 , 이거 풀면 실력 +1.2
## enumerate 메서드 : 리스트의 요소에 인덱스를 붙혀서 반환해주는 무언가.
sample4 = [20,30,40,50]
for idx, value in enumerate(sample4):
    print(f'인덱스{idx} : {value}', end=' ')